{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Цель задания: изучить синтаксис python\n",
    "\n",
    "Задание: Напишите программу, которая рассчитывает расход топлива маршрута, на вход подается длина маршрута и расход топлива на 100 километров. Используйте try catch (проверка что пользователь ввел число>0).\n",
    "\n",
    "Просто перемножаем расстояние на расход и получаем ответ, единственное сделал отдельные функции для инпута значений, что бы в ник проверять корректность ввода.\n",
    "В ходе выполнения решил по экспериментировать со словарем, в котором записаны меры исчисления расстояния и коэффициент перевода. Программа делит строку пробелом, достает значение по ключу и умножается на коэффициент. Так же можно использовать регулярные выражения, но данная для данной конструкции ввода (ЧИСЛО МЕРА) мне кажется она не нужна. Еще нужно реализовать проверку числа на 0 и так как мы используем .split проверку на ошибку индекса массива.\n",
    "Буду доделывать.\n",
    "\n",
    "Сделал проверку для второго значения."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Значенте введено неверно, поробуйте снова, пример (10 км)\n",
      "Значенте введено неверно, поробуйте снова, пример (10 км)\n",
      "Значенте введено неверно, поробуйте снова, пример (10 км)\n",
      "Значенте введено неверно, поробуйте снова, пример (10 км)\n",
      "Значенте введено неверно, поробуйте снова, пример (10 км)\n",
      "Значенте введено неверно, поробуйте снова, пример (10 км)\n",
      "Значенте введено неверно, поробуйте снова, пример (10 км)\n",
      "Значенте введено неверно, поробуйте снова, пример (10 км)\n",
      "Значенте введено неверно, поробуйте снова, пример (10 км)\n",
      "Необходимое топливо: 8.1\n"
     ]
    }
   ],
   "source": [
    "dist_calc_measures = {\n",
    "    \"км\": 0.01,\n",
    "    \"м\": 0.001,\n",
    "    \"мили\": 1.609344\n",
    "}\n",
    "\n",
    "def fuel_input():\n",
    "    while(True):\n",
    "        fuel = float(input('Введите колличество топлива: '))\n",
    "        try:\n",
    "            if fuel <= 0:\n",
    "                raise ValueError\n",
    "            else:\n",
    "                return fuel\n",
    "        except ValueError:\n",
    "            print(\"Значенте введено неверно, поробуйте снова\")\n",
    "        \n",
    "\n",
    "def length_of_route_input():\n",
    "    while(True):\n",
    "        length_of_route = input('Введите длинну маршрута: ')\n",
    "        try:\n",
    "            length_of_route = float(length_of_route.split(' ')[0]) * dist_calc_measures[length_of_route.split(' ')[1]]\n",
    "            if  length_of_route <= 0:\n",
    "                raise ValueError\n",
    "            else:\n",
    "                return length_of_route\n",
    "        except Exception:\n",
    "            print(\"Значенте введено неверно, поробуйте снова, пример (10 км)\")\n",
    "    \n",
    "def fuel_cons():\n",
    "    return fuel_input() * length_of_route_input()\n",
    "\n",
    "print(f\"Необходимое топливо: {fuel_cons()}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
