{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задание:\n",
    "1.\tЗагрузить файл длиной не менее 2000 символов. \n",
    "2.\tСоставить программу, которая считает число уникальных слов в тексте (без критерия схожести)\n",
    "3.\tСоставить программу, которая считает число гласных и согласных букв. \n",
    "4.\tСоставить программу, которая считает число предложений, их длину и число (количество) раз использования каждого слова в тексте (с критерием схожести, критерий схожести слов выбрать самостоятельно, например, spacy (en_core_web_sm) или расстояние Левенштейна). \n",
    "5.\tВывести 10 наиболее часто встречаемых слов. \n",
    "\n",
    "***\n",
    "В данном блокноте выполняем пункт 3 задания.\n",
    "\n",
    "***\n",
    "Анализ по пункту 3 задания:\n",
    "Предполагаем, что анализируется англоязычный текст.\n",
    "Для подсчета числа гласных и согласных букв достаточно проходить текст символ за символом и проверять, обозначает ли символ гласный или согласный звук.\n",
    "В случае положительного ответа увеличивать соответствующий счетчик на единицу. Поскольку число гласных мало, то можно задать только множество или строку гласных символов, а для согласных такое множество не создавать, а проверять, чтобы символ относился к алфавитным. Если символ входит в алфавит, но не относится к гласным, он будет обозначать согласную букву (хорошо, что в английском тексте нету букв типа мягкого или твердого знака, которые не обозначают ни гласные, ни согласные звуки).\n",
    "\n",
    "Тогда план работы по пункту 3 следующий.\n",
    "\n",
    "1. Загрузить текст из файла.\n",
    "2. Перевести текст в нижний регистр.\n",
    "3. Задать множество гласных букв.\n",
    "4. Проходить текст символ за символом, проверяя его принадлежность к множеству гласных. В противном случае проверяем его принадлежность к алфавитным символам. В случае положительного ответа найденный символ будет давать согласную букву.\n",
    "5. Вывести найденные значения числа согласных и гласных символов."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Загружаем текстовый файл:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Read successfully\n"
     ]
    }
   ],
   "source": [
    "# import\n",
    "\n",
    "file_name = 'GospelJohn.txt' # file with text\n",
    "try:\n",
    "    f = open(file_name,\"r\") # open file for reading\n",
    "    text = f.read()         # reading file \n",
    "    f.close()               # closing file\n",
    "    print('Read successfully')\n",
    "except:\n",
    "    print('Error reading file!')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Переводим текст в нижний регистр.\n",
    "Задаем строку гласных букв.\n",
    "Проходим по всему тексту и проверяем, гласная или согласная буква.\n",
    "Выводим результат"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of vowel letters: 738\n",
      "Number of consonant letters: 1234\n"
     ]
    }
   ],
   "source": [
    "# to lower case:\n",
    "text = text.lower()\n",
    "vowels = 'aeiou' # vowel string\n",
    "vowel_number = 0\n",
    "consonant_number = 0\n",
    "# find number of vowels and consonants\n",
    "for c in text: \n",
    "    if c in vowels:\n",
    "        vowel_number +=1\n",
    "    elif c.isalpha():\n",
    "        consonant_number +=1\n",
    "    \n",
    "print(f'Number of vowel letters: {vowel_number}')\n",
    "print(f'Number of consonant letters: {consonant_number}')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Итак, нами был проделан анализ англоязычного текста в отношении количества гласных и согласных букв.\n",
    "\n",
    "Выводы:\n",
    "1. Целесообразно предварительно переводить текст в нижний регистр (или увеличивать набор гласных букв за счет прописных букв)\n",
    "2. В англоязычном тексте размером 499 слов (2075 знаков без учета пробелов) гласных букв оказалось 738 (около 36%), согласных букв - 1234 (около 60%). Согласных букв почти в два раза больше. Знание данного соотношения для текстов на различных языках может оказаться полезным в лингвистике, прикладной криптографии и других областях, где производится анализ текстов.\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
